Revit 2026 API

# ColorDepthType Enumeration

---

An enumerated type listing all Color Depth types of Print Setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ColorDepthType
```
```vb
Public Enumeration ColorDepthType
```
```cpp
public enum class ColorDepthType
```
```fsharp
type ColorDepthType
```

| Member name | Value | Description |
| --- | --- | --- |
| BlackLine | 0 | The type of Color Depth is Black Line. |
| Color | 2 | The type of Color Depth is Color. |
| GrayScale | 1 | The type of Color Depth is Gray Scale. |

#### Reference

Autodesk.Revit.DB Namespace